logs/fio/blk/4M3/4K2_s1_q4_1_v1_blk.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=2488: Wed Jul 24 16:00:33 2019
  write: IOPS=83.0k, BW=324MiB/s (340MB/s)(9730MiB/30001msec)
    slat (usec): min=2, max=762, avg= 3.35, stdev= 1.96
    clat (usec): min=240, max=1194, avg=379.02, stdev=31.11
     lat (usec): min=244, max=1197, avg=383.08, stdev=31.05
    clat percentiles (usec):
     | 10.000th=[  363], 20.000th=[  367], 30.000th=[  367], 40.000th=[  371],
     | 50.000th=[  375], 70.000th=[  396], 90.000th=[  404], 99.000th=[  433],
     | 99.900th=[  494], 99.990th=[ 1106], 99.999th=[ 1156]
   bw (  KiB/s): min=258355, max=407653, per=79.12%, avg=262771.64, stdev=19518.30, samples=59
   iops        : min=64588, max=101913, avg=65692.61, stdev=4879.58, samples=59
  lat (usec)   : 250=0.01%, 500=99.89%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.07%
  cpu          : usr=35.37%, sys=43.87%, ctx=1080579, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2490881,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=2492: Wed Jul 24 16:00:33 2019
  write: IOPS=83.5k, BW=326MiB/s (342MB/s)(9781MiB/30001msec)
    slat (usec): min=2, max=922, avg= 4.21, stdev= 2.83
    clat (usec): min=187, max=5502, avg=759.55, stdev=64.69
     lat (usec): min=197, max=5511, avg=764.44, stdev=64.58
    clat percentiles (usec):
     | 10.000th=[  734], 20.000th=[  742], 30.000th=[  750], 40.000th=[  758],
     | 50.000th=[  766], 70.000th=[  775], 90.000th=[  799], 99.000th=[  832],
     | 99.900th=[ 1205], 99.990th=[ 1483], 99.999th=[ 5014]
   bw (  KiB/s): min=129243, max=255648, per=39.86%, avg=133090.56, stdev=12932.51, samples=118
   iops        : min=32310, max=63912, avg=33272.29, stdev=3233.14, samples=118
  lat (usec)   : 250=0.01%, 500=1.24%, 750=31.82%, 1000=66.78%
  lat (msec)   : 2=0.15%, 10=0.01%
  cpu          : usr=18.62%, sys=29.49%, ctx=1711489, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2504046,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=2496: Wed Jul 24 16:00:33 2019
  write: IOPS=85.1k, BW=332MiB/s (348MB/s)(9971MiB/30002msec)
    slat (usec): min=2, max=24025, avg= 5.93, stdev=24.16
    clat (usec): min=179, max=24550, avg=1493.70, stdev=287.92
     lat (usec): min=188, max=24562, avg=1500.71, stdev=288.99
    clat percentiles (usec):
     | 10.000th=[ 1450], 20.000th=[ 1483], 30.000th=[ 1500], 40.000th=[ 1516],
     | 50.000th=[ 1532], 70.000th=[ 1549], 90.000th=[ 1598], 99.000th=[ 1680],
     | 99.900th=[ 2040], 99.990th=[14222], 99.999th=[24511]
   bw (  KiB/s): min=75538, max=253422, per=23.69%, avg=80608.19, stdev=16133.16, samples=236
   iops        : min=18884, max=63355, avg=20151.67, stdev=4033.29, samples=236
  lat (usec)   : 250=0.01%, 500=2.49%, 750=0.60%, 1000=0.15%
  lat (msec)   : 2=96.65%, 4=0.09%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=13.62%, sys=18.62%, ctx=1021789, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2552537,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=2503: Wed Jul 24 16:00:33 2019
  write: IOPS=85.5k, BW=334MiB/s (350MB/s)(9.79GiB/30004msec)
    slat (usec): min=2, max=24149, avg=15.94, stdev=87.09
    clat (usec): min=252, max=28412, avg=2971.27, stdev=615.25
     lat (usec): min=261, max=28418, avg=2988.62, stdev=622.68
    clat percentiles (usec):
     | 10.000th=[ 2638], 20.000th=[ 2933], 30.000th=[ 3032], 40.000th=[ 3032],
     | 50.000th=[ 3064], 70.000th=[ 3097], 90.000th=[ 3163], 99.000th=[ 4621],
     | 99.900th=[ 5997], 99.990th=[15008], 99.999th=[28443]
   bw (  KiB/s): min=26705, max=123479, per=9.28%, avg=31745.87, stdev=9063.82, samples=472
   iops        : min= 6676, max=30869, avg=7936.10, stdev=2265.94, samples=472
  lat (usec)   : 500=0.58%, 750=2.13%, 1000=0.94%
  lat (msec)   : 2=0.53%, 4=93.49%, 10=2.31%, 20=0.01%, 50=0.01%
  cpu          : usr=8.67%, sys=11.34%, ctx=748499, majf=0, minf=90
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2565676,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=2514: Wed Jul 24 16:00:33 2019
  write: IOPS=85.9k, BW=335MiB/s (352MB/s)(9.83GiB/30005msec)
    slat (usec): min=2, max=4149, avg=11.03, stdev=51.28
    clat (usec): min=424, max=12594, avg=4452.76, stdev=726.33
     lat (usec): min=436, max=12810, avg=4465.40, stdev=729.14
    clat percentiles (usec):
     | 10.000th=[ 4293], 20.000th=[ 4555], 30.000th=[ 4555], 40.000th=[ 4621],
     | 50.000th=[ 4621], 70.000th=[ 4621], 90.000th=[ 4686], 99.000th=[ 4948],
     | 99.900th=[ 7701], 99.990th=[ 9634], 99.999th=[10945]
   bw (  KiB/s): min=26108, max=83630, per=8.36%, avg=28725.01, stdev=6890.75, samples=720
   iops        : min= 6527, max=20907, avg=7180.85, stdev=1722.71, samples=720
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.03%
  lat (msec)   : 2=4.18%, 4=2.89%, 10=92.90%, 20=0.01%
  cpu          : usr=7.25%, sys=8.99%, ctx=712412, majf=0, minf=131
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2576629,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=324MiB/s (340MB/s), 324MiB/s-324MiB/s (340MB/s-340MB/s), io=9730MiB (10.2GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=326MiB/s (342MB/s), 326MiB/s-326MiB/s (342MB/s-342MB/s), io=9781MiB (10.3GB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=332MiB/s (348MB/s), 332MiB/s-332MiB/s (348MB/s-348MB/s), io=9971MiB (10.5GB), run=30002-30002msec

Run status group 3 (all jobs):
  WRITE: bw=334MiB/s (350MB/s), 334MiB/s-334MiB/s (350MB/s-350MB/s), io=9.79GiB (10.5GB), run=30004-30004msec

Run status group 4 (all jobs):
  WRITE: bw=335MiB/s (352MB/s), 335MiB/s-335MiB/s (352MB/s-352MB/s), io=9.83GiB (10.6GB), run=30005-30005msec

Disk stats (read/write):
  vda: ios=309/12671848, merge=0/0, ticks=72/25033268, in_queue=25040432, util=99.05%